app/views/users/_form.html.erb

        <% hidden_field_tag "user[group_ids][]", nil %>
        <% Group.order('name').all.each do |group|%>
            <%= check_box_tag "user[group_ids][]", group.id, @user.group_ids.include?(group.id), id: dom_id(group) %>
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`name` = 'Administrators' LIMIT 1
SELECT `groups`.* FROM `groups` INNER JOIN `memberships` ON `groups`.`id` = `memberships`.`group_id` WHERE `memberships`.`user_id` = 1 AND `groups`.`id` = 1