app/controllers/brokers_controller.rb

SELECT `brokers`.* FROM `brokers`
---
  def index
    @brokers = Broker.all

INSERT INTO `brokers` (`first_name`, `last_name`, `email`, `phone`, `image`, `created_at`, `updated_at`) VALUES ('Wassef', 't', 'was', 'as', 'favicon.png', '2015-09-01 08:06:33.975803', '2015-09-01 08:06:33.975803')
---
  def create
    @broker = Broker.new(broker_params)
    clean_phone
    if @broker.save

DELETE FROM `brokers` WHERE `brokers`.`id` = 2
---
  def destroy
    deleted_broker = @broker.full_name
    @broker.destroy

SELECT  `brokers`.* FROM `brokers` WHERE `brokers`.`id` = 4 LIMIT 1
---
  def set_broker
    @broker = Broker.find(params[:id])