app/controllers/groups_controller.rb

SELECT `groups`.* FROM `groups`
---
  def index
    @groups = Group.all

INSERT INTO "groups" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Administrators"], ["created_at", "2015-08-28 22:31:01.673705"], ["updated_at", "2015-08-28 22:31:01.673705"]]
---
  def create
    @group = Group.new(group_params)
    if @group.save

DELETE FROM `groups` WHERE `groups`.`id` = 4
---
  def destroy
    @group.destroy