app/controllers/mutual_funds_controller.rb

SELECT `mutual_funds`.* FROM `mutual_funds`
---
  def index
    @mutual_funds = MutualFund.all

UPDATE `mutual_funds` SET `expense_ratio` = 0.4, `updated_at` = '2015-08-29 08:28:04.240758' WHERE `mutual_funds`.`id` = 4
---
  def update
    ticker = @mutual_fund.ticker
    if @mutual_fund.update_attributes(params[:mutual_fund])

SELECT  `mutual_funds`.* FROM `mutual_funds` WHERE `mutual_funds`.`id` = 4 LIMIT 1
---
  def set_mutual_fund
    @mutual_fund = MutualFund.find(params[:id])