app/controllers/portfolios_controller.rb

  def index
    @portfolios = Portfolio.where(:user_id => session[:user_id])
---
SELECT `portfolios`.* FROM `portfolios` WHERE `portfolios`.`user_id` IS NULL

  def show
    unless @portfolio.user_id == session[:user_id] || auth_groups(['Administrators'])
      redirect_to portfolios_path, notice: 'Access to this portfolio is denied.'
    end
    @investments = Investment.where(:portfolio => @portfolio.id)

    pie_data = [ ['Broker Fees', @portfolio.management_fee],
                 ['Expense Fees', @portfolio.average_expense_ratio],
                 ['Load Fees', @portfolio.average_load_fee],
                 ['12B-1 Fees', @portfolio.average_12b1_fee]
    ]
    @portfolio.pie_data = pie_data
    @broker = Broker.offset(rand(Broker.count)).first
---
SELECT `investments`.* FROM `investments` WHERE `investments`.`portfolio_id` = 2
SELECT  `brokers`.* FROM `brokers`  ORDER BY `brokers`.`id` ASC LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM `brokers`

  def edit
    @investments = @portfolio.investments.build
    @users = User.all
---
SELECT  `users`.* FROM `users`  ORDER BY `users`.`id` ASC LIMIT 1

  def set_portfolio
    @portfolio = Portfolio.find(params[:id])
---
SELECT  `portfolios`.* FROM `portfolios` WHERE `portfolios`.`id` = 3 LIMIT 1