app/controllers/portfolios_controller.rb

SELECT  `brokers`.* FROM `brokers` WHERE `brokers`.`id` = 1 LIMIT 1
---
  def show
    unless @portfolio.user_id == session[:user_id] || auth_groups(['Administrators'])
      redirect_to portfolios_path, notice: 'Access to this portfolio is denied.'
    end
    @investments = Investment.where(:portfolio => @portfolio.id)

    pie_data = [ ['Management Fees', @portfolio.management_fee],
                 ['Expense Fees', @portfolio.average_expense_ratio],
                 ['Load Fees', @portfolio.average_load_fee],
                 ['12B-1 Fees', @portfolio.average_12b1_fee]
    ]
    @portfolio.pie_data = pie_data
    count = Broker.count
    broker_lookup = 1 + rand(count)
    @broker = Broker.find(broker_lookup)