app/controllers/sessions_controller.rb

  def create
    user_input = params[:session][:username]
    if user_input.include? '@'
      user = User.find_by_email(params[:session][:username].downcase)
    else
      user = User.find_by_username(params[:session][:username].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "cameron.aziz"]]