app/controllers/static_pages_controller.rb

  def index
    if logged_in?
      @user = User.find(session[:user_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def profile
    @user = User.find(session[:user_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1