app/controllers/users_controller.rb

INSERT INTO `users` (`first_name`, `last_name`, `email`, `password_digest`, `username`, `created_at`, `updated_at`) VALUES ('adsa', 'adsa', 'asda', '$2a$10$607AWulrqXs7LRVukzWi0.if9hcEVphOhSscshOc8VhkxSdVd7EYS', 'adsa.adsa', '2015-09-01 09:57:19.839452', '2015-09-01 09:57:19.839452')
INSERT INTO `memberships` (`group_id`, `user_id`, `created_at`, `updated_at`) VALUES (2, 5, '2015-09-01 10:04:43.112916', '2015-09-01 10:04:43.112916')
---
  def create_register
    @user = User.new(register_params)
      if @user.save
        membership = Membership.new
        membership.group_id = '2'
        membership.user_id = @user.id
        membership.save