app/controllers/users_controller.rb

SELECT `groups`.* FROM `groups`
---
  def new
    @user = User.new
    @all_groups = Group.all

SELECT `groups`.* FROM `groups` INNER JOIN `memberships` ON `groups`.`id` = `memberships`.`group_id` WHERE `memberships`.`user_id` = 1 AND `groups`.`id` = 1
---
  def show
    @groups = @user.groups.all

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "username", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    create_username ## todo: fix so that it will error properly if username taken.
    if @user.save

UPDATE `users` SET `email` = 'cameron.aziz@brokerverified.com', `updated_at` = '2015-08-29 07:32:52.644424' WHERE `users`.`id` = 1
---
  def update
    username = @user.username
    if @user.update_attributes(user_params)